src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗамера</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Замерщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Замерщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Касса</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Замерщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательИд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактнаяИнформация</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Заказы/Forms/ФормаДокументаОсновная/Module.bsl
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция УслугиРаботаПриИзмененииСервере(СтруктураДанные)
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдИзм);
	СтруктураДанные.Вставить("Цена", СтруктураДанные.Номенклатура.ЦенаТовара+СтруктураДанные.Номенклатура.ЦенаУслуги);
	Возврат  СтруктураДанные;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСумму(СТЧ)
	СТЧ.Сумма = СТЧ.Цена * СТЧ.Количество;
КонецПроцедуры	

&НаКлиенте
Процедура УслугиРаботаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Работа);
	СтруктураДанные = УслугиРаботаПриИзмененииСервере(СтруктураДанные);
	СтрокаТабличнойЧасти.ЕдИзм = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	ПересчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидРаботПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм = Неопределено;
	СтрокаТабличнойЧасти.Цена = 0;
	СтрокаТабличнойЧасти.Сумма = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ТекущаяРоль =  МобильноеПриложениеСервер.ТекущаяРоль();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Адрес,
	               |	КонтактнаяИнформация.Телефон
	               |ИЗ
	               |	Справочник.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Владелец = &Владелец
	               |	И КонтактнаяИнформация.Адрес <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	Рез = Запрос.Выполнить().Выбрать();
	Значение = Рез.Следующий();
	Если Значение Тогда
		ЭтаФорма.Адрес = Рез.Адрес;
		ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = Рез.Телефон;
		Если ЗначениеЗаполнено(Рез.Телефон) Тогда
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок = "Позвонить";
			ЭтаФорма.Элементы.КнопкаПозвонить.Доступность = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.Адрес) Тогда
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.НайтиНаКарте.Заголовок = "Найти на карте";
			ЭтаФорма.Элементы.НайтиНаКарте.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяРоль) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяРоль = "Замерщик" Тогда
		ЭтаФорма.Элементы.Замерщик.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.Замерщик.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
	СредстваТелефонии.НабратьНомер(ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок,Ложь);
	Иначе
		Сообщить("Не поддерживается набор номера");
	КонецЕсли;
#Иначе	
	ЗапуститьПриложение("tel: "+ЭтаФорма.Элементы.КнопкаПозвонить.Заголовок);
#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура НайтиНаКарте(Команда)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Адрес) Тогда
		Возврат;
	КонецЕсли;
#Если МобильноеПриложениеКлиент Тогда	
	СтруктураКоординат = ОбменДаннымиКлиент.ПолучитьКоординатыПоАдресу(ЭтаФорма.Адрес);
	Координаты = Новый ГеографическиеКоординаты(СтруктураКоординат.lat,СтруктураКоординат.lng);
	ПоказатьНаКарте(Координаты);
#КонецЕсли
КонецПроцедуры
